# FormArrayIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormArrayIterator Class
Members See Also
---
An iterator to a form array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class FormArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class FormArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class FormArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FormArrayIterator
# See Also
FormArrayIterator Members
Autodesk.Revit.DB Namespace